docs/recipes/curried-sweet-potato-and-lentil-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Curried Sweet Potato and Lentil Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/spoon.ico" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Curried Sweet Potato and Lentil Soup</h1>
<p>
<a href="http://leitesculinaria.com/106497/recipes-curried-sweet-potato-and-lentil-soup.html">Original link</a>
</p>

<div id="outline-container-org7019236" class="outline-2">
<h2 id="org7019236">Ingredients</h2>
<div class="outline-text-2" id="text-org7019236">
<ul class="org-ul">
<li>500g sweet potatoes (1 to 2 sweet potatoes)</li>
<li>2 cups (350 grams) red split lentils</li>
<li>1 to 2 teaspoons mild olive or vegetable oil</li>
<li>1 1/2 to 3 tablespoons (up to 112 grams) red curry paste</li>
<li>6 1/2 cups (1.5 liters) stock (whether beef stockor chicken stock or</li>
<li>vegetable stock), plus more as needed</li>
<li>Juice of 2 limes (3 to 4 tablespoons)</li>
<li>Coarse black pepper</li>
<li>Sea salt flakes</li>
<li>Cilantro, crushed peanuts, or coconut milk for garnish (optional)</li>
</ul>
</div>
</div>

<div id="outline-container-org2d9a189" class="outline-2">
<h2 id="org2d9a189">Instructions</h2>
<div class="outline-text-2" id="text-org2d9a189">
<ol class="org-ol">
<li>Peel the sweet potatoes and chop them into 1/2-inch (1-cm) dice.</li>
<li>Rinse the lentils in a sieve under cold running water until the water runs clear.</li>
<li>Heat a large saucepan or pot&#x2014;one that has a lid&#x2014; over medium-high heat. Add the oil and red curry paste and stir-fry just until it becomes strongly aromatic, about 1 minute. If you like things with just a mild heat, add just 1 1/2 tablespoons red curry paste. If you like things hotter, opt for 2 to 3 tablespoons red curry paste.</li>
<li>Add the potato and lentils and stir to coat them with the paste. Pour in the stock and bring everything to a boil. Reduce the heat to a very gentle simmer, cover, and gently simmer just until the lentils and sweet potato are soft, 25 to 35 minutes. Remove from the heat.</li>
<li>If using a blender or food processor, let the soup cool for at least 10 minutes and then carefully ladle it into a food processor and blitz until smooth, working in batches if necessary. The soup will be quite thick. If a thinner soup is desired, add stock as necessary. Return the soup to the pan and, if necessary, rewarm over low heat. If using an immersion or stick blender, stick the blender straight in the pot and puree until smooth. If a thinner soup is desired, add stock as necessary. If necessary, rewarm over low heat.</li>
<li>Add a generous pinch of pepper and the lime juice to the soup and stir to combine. Serve immediately and, if desired, garnish with cilantro, peanuts, or a drizzle of coconut milk. Serve immediately (As with most soups, this freezes just fine in an airtight container or portioned in individual servings in resealable plastic bags. Defrost and rewarm over low heat before serving. Keep in mind that the soup will thicken in the fridge or freezer, so you'll need to add more stock or water when rewarming it to attain the original consistency.)</li>
</ol>
</div>
</div>
</div>
</body>
</html>
